["I am a three-digit number. My tens digit is five more than my units digit, and my hundreds digit is eight less than my tens digit. What number am I?", "I am a two-digit number. My tens digit is three times the units digit, and the sum of my digits is equal to 12. What number am I?", "I am a two-digit number. My tens digit is twice my units digit, and if you subtract my units digit from my tens digit, the result is 4. What number am I?", "I am a two-digit number. My tens digit is four less than my units digit and if you add my digits together, the result is ten. What number am I?", "I am a four-digit number. My thousands digit is three times my hundreds digit, my tens digit is one less than my hundreds digit, and my units digit is the sum of my thousands and tens digits. What number am I?", "I am a number that's greater than ten, but less than a hundred too. My tens digit is half of my units, and the sum of my digits is twenty - can you tell me who?", "I can be cracked, made, told, and played; I can be long or short, but I'm always displayed. What am I?", "I am a number with a curious fate.\\nDouble me, and add four to my weight.\\nSubtract six, and I’ll still be bright,\\nMy square is less than twelve times my height.\\nWhat number am I?", "I have mountains and valleys, rivers and lakes,\nI am split into countries, with borders that make.\nSome call me a continent, large and proud,\nWhere many call home, in crowds or alone.\nWhat am I?", "I am a two-digit number with a special link.  \nMy units digit is three times my tens, think!  \nIf you add my digits, they perfectly equal ten,  \nWhat number am I, can you figure the pen?", "I can be found in books, but I'm not alive,  \nI carry stories, where wonders thrive.  \nI have pages and words, yet I do not speak,  \nIn a world of knowledge, I am unique.  \nWhat am I?", "I can be long or short, I can be fast or slow,  \nI can bring you joy or leave you feeling low.  \nYou can give me your time, but please don’t waste me,  \nFor I am something that everyone can see.  \nWhat am I?", "I speak without a mouth and hear without ears. I have no body, but I can deliver fears. What am I?", "I am a three-digit number, bright and neat.  \nMy hundreds digit is two times my units, what a feat!  \nIf you add my digits, the result is ten.  \nTell me, what number am I, my friend?", "I have keys but open no locks,  \nI have space but no room,  \nYou can enter, but you can't go outside,  \nWhat am I?", "I am a two-digit number, that's what I'll say.  \nMy tens digit is one more than twice my units, so clever and gray.  \nIf you multiply my digits, the result is also true;  \nThe product is equal to six, can you guess who?", "I am a three-digit number, not too hard to see.  \nMy hundreds digit is four less than my tens, you see.  \nMy tens digit is half of my units, that's right!  \nAdd all my digits, and you’ll find a sum that is bright.  \nWhat number am I?", "I am a word of letters three,  \nAdd two more to rescue me.  \nIn oceans deep, I may be found,  \nA floating life where waves abound.  \nWhat am I?", "I am a two-digit number, my units digit and tens digit are far from same.  \nIf you multiply my digits, they make eight just the same.  \nAlso, if you swap my digits, the new number is two less than my original name.  \nWhat number am I?", "I am a vast expanse that stretches far and wide,  \nCovering 71% of Earth, where mysteries hide.  \nI am home to creatures both great and small,  \nWith tides that ebb and flow; some call me a ball.  \nWhat am I?", "I am a line of code, precise and neat,  \nIn the world of Python, I can't be beat.  \nI help you loop, compare, or repeat,  \nWithout me, your logic is incomplete.  \nWhat am I?", "I am a two-digit number, can you see?  \nMy units digit is twice the tens, and as it may be.  \nIf you subtract my tens from my units with glee,  \nThe answer will be three, so think carefully.  \nWhat number am I?", "I can make you dance, or bring a tear,  \nWith melodies sweet, and rhythms clear.  \nI have my verses, my chorus too,  \nSung by many, including you.  \nWhat am I?", "\"Hello from the other side,  \nI must have called a thousand times,  \nTo tell you I'm sorry for everything that I've done,  \nBut when I call you never seem to be home.\"  \nWhat song am I?"]